<h2>Extended Description (Descripci&oacute; ampliada)</h2>

<h3>Descripcions multiling&uuml;es</h3>

<p>Las descripciones multiling&uuml;es es col&middot;loquen entre les etiquetes [lang=xx] i [/lang], O xx &eacute;s el c&oacute;di de l'idioma (per exemple ca, fr, en, es, it, de...)
Existeixen tamb&eacute; 2 etiquetes especials: [lang=default] i [lang=all]</p>

<ul>
  <li><b>Exemple d'utilitzaci&oacute;:</b>:<br>
  <br>
<code>[lang=default] Descripci&oacute; predeterminada [/lang]<br>
[lang=ca] Descripci&oacute; en catal&agrave; [/lang]<br>
[lang=fr] Descripci&oacute;n ello francais [/lang]<br>
[lang=it] Descripci&oacute;n en italiano [/lang]</code>
</li>
</ul>

<p>La descripci&oacute; predeterminada s'utilitza si la descripci&oacute; no est&agrave; disponible en l'idioma que l'usuari ha seleccionat.
Si [lang=default] no existeix, tot el que estigui situat entre les etiquetes d'idioma estar&agrave; considerat como a descripci&oacute;n predeterminada.</p>

<p><u>Etiqueta especial  <i>all</i></u>: Tot el que estigui situat entre les etiquetes [lang=all] i [/lang] ser&agrave; incl&ograve;s en la descripci&oacute;, sigui quin sigui l'idioma de l'usuari.
Aix&ograve; &eacute;s especialment pr&agrave;ctic per a incloure codi html o javascript en una descripci&oacute;.</p>


<h3>Descripcions extenses</h3>

<p>Les etiquetes de descripci&oacute; extensa permeten tindre una descripci&oacute; redu&iuml;da per a la presentaci&oacute; d'un &agrave;lbum, una descripci&oacute; extensa per  la descripcio que s'exibeix sobre la p&agrave;gina de l'&agrave;lbum, o dos descripcions diferents sobre la p&agrave;gina de l'&agrave;lbum.</p>

<p>L'etiqueta &lt;!--more--&gt; permet afegir text a la descripci&oacute; redu&iuml;da.<br>
L'etiqueta &lt;!--complete--&gt; permet a l'usuari tenir 2 descripcions diferents.<br>
L'etiqueta &lt;!--up-down--&gt; permet a l'usuari posar una descripci&oacute; per sota i una altra per sobre.</p>

<ul>
  <li><b>Etiqueta &lt;!--more--&gt;</b></li>
</ul>
<code>Descripci&oacute; reducida &lt;!--more--&gt; Descripci&oacute;n detallada</code>
<p>Nom&eacute;s la descripci&oacute; breu es mostra fora de l'&agrave;lbum. A la p&agrave;gina de l'&agrave;lbum, veur&agrave;s la descripci&oacute; curta + descripci&oacute; llarga.</p>

<ul>
  <li><b>Etiqueta &lt;!--complete--&gt;</b></li>
</ul>
<code>Descripci&oacute; reducida &lt;!--more--&gt; Descripci&oacute;n detallada</code>
<p>Nom&eacute;s la descripci&oacute; de la part superior es mostra fora de l'&agrave;lbum. A la p&agrave;gina de l'&agrave;lbum, la descripci&oacute; de la part superior es mostra per sobre de les miniatures, la descripci&oacute; de la part inferior es mostra sota de les miniatures.</p>

<ul>
  <li><b>Etiqueta &lt;!--up-down--&gt;</b></li>
</ul>
<code>descripci&oacute;n alta &lt;!--up-down--&gt; descripci&oacute;n baja</code>
<p>Nom&eacute;s la descripci&oacute; de la part superior es mostra fora de l'&agrave;lbum. A la p&agrave;gina de l'&agrave;lbum, la descripci&oacute; de la part superior es mostra per sobre de les miniatures, la descripci&oacute; de la part inferior es mostra sota de les miniatures.</p>

<h3>Insertar un &agrave;lbum o una imatge</h3>

<ul>
  <li><b>Etiqueta [cat=xx]</b></li>
</ul>
<p>Aquesta etiqueta permet insertar un &agrave;lbum en la descripci&oacute;n, on xx &eacute;s l'&agrave;lbum identificador</p>

<ul>
  <li><b>Etiqueta [img=xx1 xx2 xxN;yyyy;name]</b></li>
</ul>
<p>Aquesta etiqueta permet insertar una imatge en la descripci&oacute;, amb:<br><br>
- xx L'identificador de la imatge; &Eacute;s possible afegir l'identificador de l'&agrave;lbum al costat de l'identificador de la imatge: <code>xx.ccc</code>.
<br>
- yyyy (opcional): Pot prendre qualsevol valor entre {left, right}.</p>
- Nom (opcional): Pot prendre qualsevol valor entre {left, titleName}. Si est&agrave; etiquetat amb el valor <i>name</i>, el nom de la imatge es visualitza sota la miniatura. Amb <i>titleName</i> el nom de la imatge s'informa a l'etiqueta <i>&lt;title&gt;</i> de la imatge.</p>

<h3>Ocultar un &agrave;lbum</h3>

<p>Utilitzar la etiqueta <b>&lt;!--hidden--&gt;</b> en el nom de l'&agrave;lbum:<br>
<br>
- No es mostrar&agrave; en l'&agrave;lbum pare (el seu nivell superior directe)<br>
- Segueix sent visible al men&uacute; &Agrave;lbums</p>

<h3>Ocultar un &agrave;lbum en el men&uacute;</h3>

<p>Utilitzar l'etiqueta <b>&lt;!--mb-hidden--&gt;</b> en el nom de l'&agrave;lbum:<br>
<br>
- No es mostrar&agrave; en l'&agrave;lbum pare (el seu nivell superior directe)<br>
- Segueix sent visible al men&uacute; &Agrave;lbums</p>

<h3>Ocultar una imatge</h3>

<p>Utilitzar l'etiqueta <b>&lt;!--hidden--&gt;</b> en el nom de la imatge:<br>
<br>
- No es mostrar&agrave; a la p&agrave;gina de miniatures<br>
- Continua sent visible a l'interior de l'&agrave;lbum</p>

<h3>&Agrave;lbum redirigit</h3>

<ul>
<li><b>[redirect http://piwigo.org]</b></li>
</ul>
<p>Afegir la seg&uuml;ent etiqueta en la descripci&oacute; de l'&agrave;lbum per redirigir-lo a una URL determinada.</p>

<ul>
<li><b>[redirect img=xx]</b></li>
</ul>
<p>Redirigir a una imatge de la galeria indicada on <code>xx</code> &eacute;s l'identificador de la imatge. Es pot afegir l'identificador junt a la imatge: <code>xx.ccc</code>.</p>

<ul>
<li><b>[redirect cat=xx]</b></li>
</ul>
<p>Redirigeis a un &agrave;lbum de la galeria (substitueix xx per un &agrave;lbum).</p>

<ul>
<li><b>[redirect search=xx]</b></li>
</ul>
<p>Redirigeix a una p&agrave;gina de cerca de la galeria (substitueix xx per l'identificador de cerca)'.</p>