<div style="text-align:left;">
<h2> Descri&ccedil;&atilde;o extensa </h2>

<h3> Descri&ccedil;&otilde;es multi-idioma </h3>

<p> Descri&ccedil;&otilde;es multi-idioma s&atilde;o colocados entre etiquetas [lang=xx] e [/lang], onde xx &eacute; o c&oacute;digo da l&iacute;ngua (por exemplo, en, es, fr,pt). H&aacute; tamb&eacute;m 2 linguagens especiais: [lang=default] e [lang=all] </p>

<ul>
<li> <b> Exemplo </b>: <br>
<br>
<code> [lang=default] default description [/lang] <br>
[lang=en] description in english [/lang] <br>
[lang=de] deutsche Beschreibung [/lang] <br>
[lang=pt] descri&ccedil;&atilde;o portugu&ecirc;s [/lang]</code>
</li>
</ul>

<p> A descri&ccedil;&atilde;o padr&atilde;o ser&aacute; usada se a descri&ccedil;&atilde;o n&atilde;o est&aacute; dispon&iacute;vel no idioma seleccionado pelo utilizador ligado.
Se [lang=default] n&atilde;o existe, qualquer coisa fora das etiquetas [lang] ser&aacute; considerada como descri&ccedil;&atilde;o padr&atilde;o. </p>

<p> <u> Idioma especial <i> all </i> </u>: nada dentro [lang=all] ser&aacute; inclu&iacute;do na descri&ccedil;&atilde;o, qualquer que seja o idioma definido pelo utilizador.
Isto &eacute; principalmente &uacute;til para incluir c&oacute;digos HTML / JavaScript numa descri&ccedil;&atilde;o.</p>

<h3> Descri&ccedil;&otilde;es extensas</h3>

<p> Descri&ccedil;&atilde;o extensa torna poss&iacute;vel ter uma breve descri&ccedil;&atilde;o para o album fora do album, uma descri&ccedil;&atilde;o mais longa do album dentro da p&aacute;gina do album,ou at&eacute; 2 descri&ccedil;&otilde;es distintas dentro da p&aacute;gina do album.</p>

<p>tag &lt;!--more--&gt; adiciona texto &agrave; descri&ccedil;&atilde;o curta <br>.
tag &lt;!--complete--&gt; permite que o utilizador tenha 2 descri&ccedil;&otilde;es distintas.<br>
tag &lt;!--up-down--&gt; permite que o utilizador tenha uma descri&ccedil;&atilde;o superior e uma descri&ccedil;&atilde;o inferior </p>.

<ul>
  <li><b>tag &lt;!--more--&gt;</b></li>
</ul>
<code>short description &lt;!--more--&gt; descri&ccedil;&atilde;o longa</code>
<p>Apenas a descri&ccedil;&atilde;o curta &eacute; exibida fora do album. Na p&aacute;gina do album, ver-se-&aacute; a descri&ccedil;&atilde;o curta +  a descri&ccedil;&atilde;o extensa.</p>

<ul>
<li><b>tag &lt;!--complete--&gt;</b></li>
</ul>
<code>short description &lt;!--complete--&gt; long description</code>
<p> apenas a descri&ccedil;&atilde;o curta &eacute; exibida fora do album. Na p&aacute;gina do album,  ver-se--&aacute; a descri&ccedil;&atilde;o longa, ent&atilde;o temos 2 descri&ccedil;&otilde;es distintas.</p>

<ul>
<li><b>tag &lt;!--up-down--&gt;</b></li>
</ul>
<code>top description &lt;!--up-down--&gt; bottom description</code>
<p> Apenas descri&ccedil;&atilde;o topo &eacute; exibida fora do album. Na p&aacute;gina do album, a descri&ccedil;&atilde;o topo &eacute; exibida acima das miniaturas, a descri&ccedil;&atilde;o inferior &eacute; exibida abaixo das miniaturas.</p>

<h3>Inserir um album ou uma foto</h3>

<ul>
  <li><b>tag [cat=xx]</b></li>
</ul>
<p> Esta etiqueta insere um album na descri&ccedil;&atilde;o, onde xx &eacute; o identificador do album.</p>

<ul>
  <li><b>[photo id=xx album=yy size=M  html=yes link=yes]</b></li>
</ul>
<p>Esta etiqueta permite inserir uma imagem de qualquer tamanho que você queira, com:<br><br>
- <code>id</code> identificador da foto <br>
- <code>album</code> (opcional) o identificador do album pai<br>
- <code>size</code> (opcional) o tamanho da foto, entre <i>{SQ, TH, XXS, S, M, L, XL, XXL}</i><br>
- <code>html</code> (opcional) se definido para NÃO retorna a URL da foto, sem HTML<br>
- <code>link</code> (opcional) se definido para SIM a foto é incluida num link para a página da foto</p>

<ul>
  <li><b>[random album=yy size=M html=yes link=yes]</b></li>
</ul>
<p>A Mesma coisa que acima, exceto que a foto é escolhida aleatoriamente em random dentro <code>album</code></p>

<ul>
  <li><b>[slider album=xx nb_images=10 random=no list=aa,bb,cc size=M speed=3 title=no effect=fade arrows=yes control=yes elastic=no]</b></li>
</ul>
<p>Esta etiqueta permite inserir um slideshow (NivoSlider), com (você deve definir<code>album</code> OR <code>list</code>):<br><br>
- <code>album</code> (opcional)fonte album<br>
- <code>nb_images</code> (opcional)máximo numero de fotos para exibir no slideshow<br>
- <code>random</code> (opcional) escolhe fotos aleatoriamente no álbum<br>
- <code>list</code> (opcional) uma lista de fotos com ids separados por vírgula<br>
- <code>size</code> (opcional) o tamanho das fotos, entre <i>{SQ, TH, XXS, S, M, L, XL, XXL}</i><br>
- <code>speed</code> (opcional) Velocidade de transição<br>
- <code>title</code> (opcional) mostra título da foto.<br>
- <code>effect</code> (opcional) efeito de transição (opcional) (ver <a href="http://nivo.dev7studios.com/support/jquery-plugin-usage/">NivoSlider doc</a>)<br>
- <code>arrows</code> (opcional) mostra setas de navegação<br>
- <code>control</code> (opcional) exibe os controles de navegação<br>
- <code>elastic</code> (opcional) adapta o tamanho do slideshow para cada foto</p>


<h3>Hide an album</h3>

<p>Use tag <b>&lt;!--hidden--&gt;</b> in the album name:<br>
<br>
- it won't be displayed in the parent album<br>
- it remains visible in the album menu</p>

<h3>Hide an album from the menu</h3>

<p>Use tag <b>&lt;!--mb-hidden--&gt;</b> in the album name:<br>
<br>
- it won't be displayed in the album menu<br>
- it remains visible in the parent album</p>

<h3>Hide a photo</h3>

<p>Use tag <b>&lt;!--hidden--&gt;</b> in the photo name:<br>
<br>
- it won't be displayed on the thumbnails page<br>
- it remains visible inside the album</p>

<h3>Redirected album</h3>

<ul>
  <li><b>[redirect http://piwigo.org]</b></li>
</ul>
<p>Insert this tag into a album description to redirect it to the URL of your choice.</p>

<ul>
  <li><b>[redirect img=xx]</b></li>
</ul>
<p>Redirect to a photo of your gallery where xx is the photo identifier; you can add the album identifier next to the photo identifier: <code>xx.ccc</code>.</p>

<ul>
  <li><b>[redirect cat=xx]</b></li>
</ul>
<p>Redirect to a album of your gallery where xx the album identifier.</p>

<ul>
  <li><b>[redirect search=xx]</b></li>
</ul>
<p>Redirect to a search page of your gallery where xx is the search identifier.</p>
</div>